//큐 queue 

//스택은 어떤 구조를 가지고 있는 자료구조인가 ? 
//last in first out (lifo)

//3개의 메서드를 가지고 있다. 
//push , pop , peek 

//push ? 
//인자로 들어온 값을 스택에 마지막에 넣어주는 메서드. 

//pop ? 
//마지막에 들어온 엘레먼트를 스택에서 제거 후 반환 하는 메서드 

//peek ? 
//스택에 가장 마지막에 들어온 항목을 반환하는 메서드 

//실제로 스택을 구현 해보세요 .
//함수로 하던지 , 클래스문법으로 만들던지 내부에 stack 배열은 캡슐화 하여야 합니다. 

//array arrayList; 
//array 특정 데이터 타입만 넣을 수 있다. , (number, string, Object)
//배열의 길이가 처음부터 정해져있다. 

//arrayList 아무 데이터 타입이나 넣을 수 있다. (다른 데이터 타입의 데이터들을 한 배열에 
//넣을 수 있다. ) 
//배열의 길이가 정해져 있지 않다. 

//

//