//객체란 무엇인가 ? 
//객체란 왜 사용하는 것일까요 ? 현실에 있는 정신적,추상적,물질적인 것들을
//표현하기 위해서 사용합니다. 

//객체의 프로퍼티는 무엇과 무엇의 쌍으로 이루어져 있나요 ? 
//객체의 메서드는 무엇인가 ? 키와 함수의 쌍으로 이루어져있다. 
//메서드가 일반 함수와 다른 점은 무엇인가요 ? 메서드는 특정 객체들만 사용할 수 있는 기능
//함수는 객체에 국한 되어 사용되지 않는다. 

//클래스를 아는만큼 설명해보라 
//어떤 객체의 형태의 정보를 가지고 있는 틀 인스턴스를 복제 할 수 있게 만드는 틀

//변수에 객첼리터럴을 할당하여 본인을 표현 해보라 프로퍼티 3개 , 메서드 1개 

//프로퍼티중 한가지를 출력하고 메서드를 호출해보라 

//함수를 이용해서 스마트폰 클래스를 만들어 보라 
//이때 모델명, 통신사, 전화번호를 매개변수로 받아 각 프로퍼티에 할당하고, 
//전달인자로 전화번호를 받아 ${나의 번호}가 ${전화 번호}에 전화를 거는 중입니다. 라는
//메시지를 출력하도록 만들어 보라 

//이때 생성사 함수와, 객체리터럴을 반환하는 함수로 1개씩 만들어보라 

//class문법으로 만들고 showinfo라는 메서드를 추가하여 현재의 모델명,통신사,본인 번호를 
//출력하도록 하세요 

