//1. 어제 내준 숙제 리뷰
//2. 퀴즈 
//3. 스코프 
//4. 클로저 

//무기명 함수랑 기명함수의 차이는 ? 이름의 유무 
//무기명 함수를 쓰려면 어떻게 해야하는가 ? 함수표현식
//iife란 무엇인가 ? 선언과 동시에 함수를 호출 하는 방법
//변수명 충돌 방지 , 재사용 불가  
//sum 전달인자로 2개의 숫자를 받아 두개의 값을 더한 값을 반환하여, 
//상수 result에 20,25의 더한 값을 할당하라 . 이때 sum함수는 애로우 펑션으로 
//만들것 

//print 첫번째 전달인자로 들어온 배열의 0번째부터 끝까지 출력하는 함수를 만들세요 
//2번쨰 전달인자로 숫자 타입을 주는데 만약 이 숫자가 1이라면 앞에서 춢력 하고 아니라면 뒤
//뒤에서 부터 출력하시오 

//에로우 펑션이란 ? function 키워드와 block 을 줄이기 위한 단축 문법 (무기명)
//에로우 펑션의 3가지 단축 조건? 

//기본 
//매개변수가 한개일 때 파라메터를 감싼 소괄호를 생략할 수 있다. 
//실행코드가 한개일때 블락을 없앨 수 있다. 

//name이라는 매개변수를 두고 전달인자로 string을 받을 것이다. 
//`${name}아 안녕`